Repository: openimis/openimis-be_py
Catalog: openIMIS/locale/*/LC_MESSAGES/django.po
Languages: fr

# claim.mutation.authentication_required
source: User needs to be authenticated for this operation
fr: L'utilisateur doit être authentifié pour cette opération

# claim.validation.id_does_not_exist
source: Claim with id %(id)s does not exist
fr: La prestation %s n'existe pas

# claim.mutation.failed_to_change_status_of_claim
source: Failed to change status of claim %(code)s
fr: Échec de la modification du statut de la demande %s

# claim.validation.pricelist.item
source: Couldn't find a valid item price list item for %s in location %s
fr: Impossible de trouver un produit médical valide dans liste de prix des produits de santé pour le soin %s dans le lieu %s

# claim.validation.pricelist.service
source: Couldn't find a valid service price list for the service %s in location %s
fr: Impossible de trouver un soin valide dans liste de prix des soins pour le soin %s dans le lieu %s

# claim.validation.validity.item
source: Claim Item %s is referencing item %s that is invalid
fr: Le produit médical de la prestation %s fait référence à un produit médical %s qui n'est pas valide

source: claim.validation.validity.service
fr: Soin de la prestation %s fait référence à un soin %s qui n'est pas valide

source: claim.validation.care_type.service
fr: Ce type de soins %s n'est pas compatible avec type de soins dans les établissements de santé %s avant %s alors que la prestation date du%s

# claim.validation.target_date
source: %(code)s: Neither date_from nor date_to is specified
fr: Prestation %s : ni "date de début" ni "date de fin" ne sont spécifié

source: claim.validation.care_type.item
fr: Ce type de soins %s n'est pas compatible avec type de soins dans les établissements de santé %s avant %s alors que la prestation date du%s

# claim.validation.limitation.item
source: ClaimItem %s referencing item %s has a patient category mask of %s but insuree has a mask of %s
fr: Le produit médical %s de la prestation réfère vers le produit médical %s qui un masque de catégorie de patient %s mais l'assuré a un masque de %s

# claim.validation.limitation.service
source: Claim Service %s referencing service %s has a patient category mask of %s but insuree has a mask of %s
fr: Le soin %s de la prestation réfère vers le soin %s qui un masque de catégorie de patient %s mais l'assuré a un masque de %s

# claim.validation.family.insuree_validity
source: claim %(code)s: Insuree %(insuree)s validity expired
fr: prestation %(code)s: Assuré %(insuree)s n'est plus valide

# claim.validation.family.no_family
source: %(code)s: Insuree %(insuree)s should have a family, even if only one member
fr: L'assuré %s doivent avoir une famille, même s'il ne s'agit que d'un seul membre

# claim.validation.product_family.waiting_period
source: %(code)s: Item/service %(element)s waiting period violation
fr: Violation du délai d'attente pour le soin ou le produit médical %s

# claim.validation.product_family.max_nb_allowed
source: %(code)s: Item/service %(element)s, provided %(provided)s over maximum number allowed %(max)s
fr: %(code): %(element) soins et %(provided) produit médicaux est supérieur au nombre maximum de prestations et de produits de santé %(max)

# claim.validation.product_family.no_product_found
source: %(code)s: No product item/service found for %(element)s
fr: Pas de produit/soin trouvé pour %s

# claim.validation.product_family.max_nb_surgeries
source: %(code)s: %(count)s is over maximum surgeries %(max)s
fr: %s est supérieur au nombre maximum d'opérations chirurgicales %s

# claim.validation.product_family.max_nb_deliveries
source: %(code)s: %(count)s is over maximum deliveries %(max)s
fr: %s est supérieur aux nombres d'accouchements maximum %s

# claim.validation.product_family.max_nb_antenatal
source: %(code)s: %(count)s is over maximum antenatal services %(max)s
fr: %s est supérieur au nombre maximum des soins parentaux: %s

# claim.validation.product_family.max_nb_hospitalizations
source: %(code)s: %(count)s is over maximum hospitalizations %(max)s
fr: %s est supérieur au nombre maximal d'hospitalisations %s

# claim.validation.product_family.max_nb_visits
source: %(code)s: %(count)s is over maximum visits %(max)s
fr: %s est supérieur au nombre maximal de visites %s

# claim.validation.assign_prod.item.no_product_code
source: Claim item %s refers to an item %s that doesn't seem to have a valid Policy ⇾ Product
fr: Le produit médical de la prestation %s fait référence à un produit médical %s qui ne semble pas avoir être couver par la police de l'assuré

# claim.validation.assign_prod.service.no_product_code
source: Claim service %s refers to a service %s that doesn't seem to have a valid Policy ⇾ Product
fr: Le soin de la prestation %s fait référence à un soin %s qui ne semble pas avoir être couver par la police de l'assuré

# unauthorized
source: User not authorized for this operation
fr: Utilisateur non autorisé pour cette opération

# claim.mutation.failed_to_create_claim
source: Failed create claim %(code)s
fr: Échec de la création de la prestation %(code)s

# claim.mutation.failed_to_update_claim
source: Failed to update claim %(code)s
fr: Échec de la mise à jour la prestation %(code)s

# core.string.over_max_length
source: Value %(value)s is over maximum length: %(max_length)s
fr: Valeur %(valeur)s est supérieure à la longueur maximale : %(max_length)s

# claim.mutation.duplicated_claim_code
source: Claim with code %(code) already exists
fr: Prestation avec code %(code) existe déjà

# claim.mutation.failed_to_attach_document
source: Failed to attach document to the claim %(code)s
fr: Impossible de joindre le document à la prestation %(code)s

# claim.mutation.failed_to_delete_claim_attachment
source: Failed delete attachment from claim %(code)s
fr: Échec de la suppression de la pièce jointe à la prestation %(code)s

# claim.validation.all_items_and_services_rejected
source: %(code)s: All claim items/services are rejected
fr: %(code)s : Tous les soins et les produits de santé de la prestation sont rejetés

# claim.validation.assign_prod.elt.no_product_code
source: %(code)s: Claim service/item %(elt)s doesn't seem to have a valid Policy->Product
fr: %(code)s: le soin ou le produit médical de la prestation %(elt)s ne semble pas être prise en charge par la police de l'assuré

# claim_batch.reports.nodata
source: No data for the report
fr: Pas de données pour le rapport de lot

# core.insuree.unknown_gender
source: Unknown gender
fr: Genre inconnu

# core.insuree.unknown_dob
source: Unknown date of birth
fr: Date de naissance inconnue

# location.mutation.failed_to_create_location
source: Failed create location %(code)
fr: Échec de la création du lieu %(code)

# location.mutation.failed_to_update_location
source: Failed to update location %(code)
fr: Échec de la mise à jour du lieu % (code)

# location.mutation.failed_to_delete_location
source: Failed delete location %(code)
fr: Échec de la suppression du lieu %(code)

# location.mutation.failed_to_move_location
source: Failed to move location %(code)
fr: Échec du déplacement du lieu %(code)

# location.mutation.failed_to_create_health_facility
source: Failed create health facility %(code)
fr: Échec de la création d'un établissement de santé %(code)

# location.mutation.failed_to_update_health_facility
source: Failed to update health facility %(code)
fr: Échec de la mis à jour de l'établissement de santé %(code)

# location.mutation.failed_to_delete_health_facility
source: Failed delete health facility %(code)
fr: Échec de la suppression de l'établissement de santé %(code)

# policy.mutation.failed_to_create_policy
source: Failed to create policy
fr: Échec de la création de la police

# policy.mutation.failed_to_update_policy
source: Failed to update policy
fr: Échec de la mise à jour de la police

# policy.mutation.failed_to_renew_policy
source: Failed to renew policy
fr: Échec du renouvellement de la police

# policy.mutation.failed_to_suspend_policy
source: Failed to suspend policy
fr: Échec de la suspension de la police

# policy.mutation.id_does_not_exist
source: Policy %(id)s doesn't exist
fr: La police %s n'existe pas

# policy.mutation.failed_to_change_status_of_policy
source: Failed to change status of policy %(policy)s
fr: Échec de la modification du statut de la police %(policy)s

# policy.validation.id_does_not_exist
source: Policy %(id)s doesn't exist
fr: La police %(id)s n’existe pas

# policy.mutation.policy_not_idle
source: Only idle policies can be updated
fr: Seules les polices inactives peuvent être mises à jour

# policy.validation.members_count_above_max
source: Number of insurees %(count)s is above policy maximum: %(max)s
fr: Le nombre d'assurés %(nombre) est supérieur au maximum de la police : %(max)s

# insuree.mutation.failed_to_create_family
source: Failed to create family
fr: Échec de la création de la famille

# insuree.mutation.failed_to_delete_family
source: Failed to delete family %(uuid)s
fr: Échec de la suppression de la famille %(uuid)s

# insuree.mutation.failed_to_create_insuree
source: Failed to create insuree
fr: Échec de la création de l'assuré

# insuree.mutation.failed_to_update_insuree
source: Failed to update insuree
fr: Échec de la mise à jour de l'assuré

# insuree.mutation.failed_to_delete_insuree
source: Failed to delete insuree %(chfid)s
fr: Échec de la suppression de l'assuré %(chfid)s

# insuree.validation.id_does_not_exist
source: Insuree %(id)s doesn't exist
fr: L'assuré %(id)s n'existe pas

# insuree.validation.delete_head_insuree
source: Cannot delete family head insuree %(id)s
fr: Impossible de supprimer l'assuré chef d'une famille %(id)s

# insuree.mutation.failed_to_cancel_insuree_policies
source: Failed to cancel policies of insuree %(chfid)s
fr: Échec de l'annulation des polices de l'assuré %(chfid)s

# insuree.mutation.failed_to_remove_insuree
source: Failed to remove insuree %(chfid)s from its family
fr: Échec de la suppression de l'assuré %(chfid)s de sa famille

# insuree.validation.remove_head_insuree
source: Cannot remove head insuree %(id)s from family
fr: Impossible de supprimer l'assuré principal %(id)s d'une famille

# insuree.mutation.failed_to_set_head_insuree
source: Failed to set family head insuree
fr: Échec de la désignation de l'assuré chef de famille

# insuree.mutation.failed_to_change_insuree_family
source: Failed to change insuree from family
fr: Échec du changement de famille de l'assuré

# insuree.validation.policy_above_max_members
source: Policy %(product_code)s - %(start_date)s covers max %(max)s insurees. Current family members count: %(count)s
fr: La police %(product_code)s - %(start_date)s couvre maximum %(max)s assurés. Nombre actuel de membres de la famille: %(count)s
